{"sections":{"main":{"type":"page-faq-template","blocks":{"block-1":{"type":"heading","settings":{"heading":"GENERAL"}},"block-2":{"type":"Content","settings":{"title":"WHAT IS REVOLUTIONARY ABOUT THE AIRHOOD® ?","subtitle":"<p>The AirHood™  is the first of its kind. Its compactness makes it perfect for small and medium-sized apartments without built-in range hoods. Thanks to its effectiveness, it also offers the possibility to replace the often ugly and poorly functioning built-in range hood. Its unique and cute design also catches the eye and brings a smile to everyone who sees it. This practical kitchen companion is the solution many people have been waiting for.<\/p>"}},"27ef90ab-6c4b-4bb9-b741-eec9d3668121":{"type":"heading","settings":{"heading":"PRODUCT"}},"block-3":{"type":"Content","settings":{"title":"WHAT DOES IT MEAN TO BE OFFICIALLY ETL-CERTIFIED AS AIR CLEANER?","subtitle":"<p>The AirHood is officially certified under Intertek’s ETL Certification program as an air cleaner. The ETL Mark is proof of product compliance to North American safety standards. More details on their <a href=\"https:\/\/www.intertek.com\/marks\/etl\/\">official website<\/a>.<\/p>"}},"block-4":{"type":"Content","settings":{"title":"I COOK WITH A GAS STOVE. CAN I USE THE AIRHOOD®?","subtitle":"<p>Cooking next to an open flame exposes the AirHood to more heat than cooking with an electric or induction stove. <strong>Generally, the AirHood must always be operated in accordance with the safety instructions given in the user manual.<\/strong><\/p><p><strong>Wired version:<\/strong> Under observance of the instruction manual's safety instructions, use of the wired AirHood with gas stove is possible. However, it should be ensured that there is a sufficiently large distance to the stove in order to protect the device from intense heat exposure and subsequent damage.<\/p><p><strong>Wireless version:<\/strong>The device is battery operated and special care is required. Use of the wireless version in combination with electric and induction stoves is recommended. Use of the wireless AirHood with gas stove may cause high internal temperatures and is not recommended. This can potentially shorten the battery‘s lifespan or lead condensation inside the device, which may damage the battery's electronic circuits.<\/p>"}},"block-6":{"type":"Content","settings":{"title":"CAN I COOK WITH THE AIRHOOD® OUTDOORS ?","subtitle":"<p>The AirHood is designed to reduce smoke, odor and grease for indoor cooking where the cooktop is protected from strong winds. If you wish to use it outdoors, keep in mind that air flow and strong winds may affect the AirHood's ability to effectively help you filter out smoke.<\/p>"}},"block-7":{"type":"Content","settings":{"title":"HOW LONG IS THE CORD LENGTH FOR THE WIRED AIRHOOD® ?","subtitle":"<p>The AirHood comes with a standard US plug with a cord length of 180cm or 70 inches. For orders outside the US website, the AirHood with the corresponding EU plug will be shipped.<\/p>"}},"block-8":{"type":"Content","settings":{"title":"WHERE DOES THE EXHAUST AIR GO AFTER FILTRATION?","subtitle":"<p>The AirHood™  recirculates and recycles the air very efficiently, rather than redirecting it elsewhere. However, with The AirHood, there is no need to compromise on effectiveness. Thanks to this setup, the hood is portable and can be used anywhere—air vents out of the back of the hood.<\/p>"}},"24172c6e-e029-44c6-af1e-ede59c5c5f67":{"type":"Content","settings":{"title":"HOW DO I CLEAN MY AIRHOOD® ?","subtitle":"<p>The AirHood™  is very easy to clean. Remove the magnetically attached air duct \"in a jiffy\" and clean it wherever you like. The oil filter is mounted on the air duct utilizing a bracket, which can be removed with a quick flick of the wrist thanks to the simple twist-lock mechanism and then cleaned by hand or in the dishwasher. In addition, the activated charcoal filter behind the oil filter can be easily removed and replaced by hand.<\/p>"}},"c52f418f-dac8-45fb-a890-ecee92d4247b":{"type":"Content","settings":{"title":"HOW OFTEN SHOULD I CLEAN MY AIRHOOD®? ","subtitle":"<p>As with any other kitchen appliance, ideally you should clean the AirHood after each use. How often cleaning is necessary depends, of course, on the frequency and type of use. For example, deep frying some onion rings will require more maintenance than briefly stir frying your vegetables.<\/p>"}},"34b4b6e5-fc4f-48b7-a18b-74cc92fbcb63":{"type":"Content","settings":{"title":"HOW OFTEN DO I NEED TO REPLACE THE FILTERS?","subtitle":"<p>The activated charcoal filter should be replaced after about 100 hours of use or when cooking odors are not sufficiently filtered out anymore.<\/p>"}},"746b0a49-eb1a-4346-b44a-59bca8233969":{"type":"Content","settings":{"title":"WILL THE AIRHOOD BE SHIPPED WITH SPARE FILTERS?","subtitle":"<p>Yes, the AirHood comes with 5 replaceable activated charcoal filters -which will last for more than two years of daily cooking. Before use, place 1 activated charcoal filter into your device. The oil filter is washable, dishwasher-safe, and does not need to be replaced as long as it is cleaned frequently. Therefore, no spare oil filter will be included, but you may purchase one via the shop page if needed.<\/p>"}},"acc9524a-8b5b-4c06-ac98-81ab4c50427f":{"type":"Content","settings":{"title":"HOW CAN I GET SPARE FILTERS IF I NEED MORE?","subtitle":"<p>Head over to our accessories section and you can purchase replacement charcoal and oil filters.<\/p>"}},"block-5":{"type":"heading","settings":{"heading":"ORDERS"}},"12220a60-15c1-42a3-b9f5-43100cd964ae":{"type":"Content","settings":{"title":"WHAT PAYMENT METHODS DO YOU ACCEPT?","subtitle":"<p>Payments are possible via PayPal or credit card in Visa, MaterCard, AMEX and Apple Pay.<\/p>"}},"63ca2a3b-80d8-4700-b459-dbf73b1ba5cf":{"type":"Content","settings":{"title":"WHEN WILL MY AIRHOOD BE SHIPPED?","subtitle":"<p>Expect your order to be processed within<strong>1-3 business days<\/strong>, with delivery typically taking up to<strong>7 days<\/strong>. For more details, please check our <a href=\"https:\/\/theairhood.com\/pages\/shipping-policy\" target=\"_blank\"><strong>Shipping Policy<\/strong><\/a><strong>.<\/strong><\/p>"}},"d6fef0c8-5441-42ef-be21-1b1f39485dc9":{"type":"Content","settings":{"title":"DOES AIRHOOD OFFER WARRANTY?","subtitle":"<p>Yes! We offer a standard 1 year warranty, with a complimentary extension for 6 months warranty so you can enjoy a total of free 18 months coverage for your AirHood. In addition, you can extend further with AirHood CoverPlus. <a href=\"https:\/\/theairhood.com\/pages\/warranty-policy\" target=\"_blank\"><span style=\"text-decoration:underline\">More details here.<\/span><\/a><\/p>"}},"7f2bfce7-4607-472d-8b1a-be89445a8cb8":{"type":"Content","settings":{"title":"WILL THE AIRHOOD BE AVAILABLE OUTSIDE OF THE US?","subtitle":"<p>The AirHood Team works hard to expand and make the AirHood available to customers outside the US. You can follow us on social media to be informed about the latest developments.<\/p>"}}},"block_order":["block-1","block-2","27ef90ab-6c4b-4bb9-b741-eec9d3668121","block-3","block-4","block-6","block-7","block-8","24172c6e-e029-44c6-af1e-ede59c5c5f67","c52f418f-dac8-45fb-a890-ecee92d4247b","34b4b6e5-fc4f-48b7-a18b-74cc92fbcb63","746b0a49-eb1a-4346-b44a-59bca8233969","acc9524a-8b5b-4c06-ac98-81ab4c50427f","block-5","12220a60-15c1-42a3-b9f5-43100cd964ae","63ca2a3b-80d8-4700-b459-dbf73b1ba5cf","d6fef0c8-5441-42ef-be21-1b1f39485dc9","7f2bfce7-4607-472d-8b1a-be89445a8cb8"],"custom_css":["h2.title.faq--heading {color: #791b1b; font-weight: 800; letter-spacing: -0.02px;}"],"settings":{"wide_display":false,"show_banner":false,"mobile_image_crop":"none","caption_content_background":"original","pretext":"","title":"Page FAQ Template","subtitle":"<p>Create an amazing FAQ page with a full-width banner<\/p>","text_position":"center","text_align":"center","button1":"","button1_link":"","button1_style":"global-button--banner","button2":"","button2_link":"","button2_style":"global-button--banner"}},"d49bd09d-3411-49ca-b909-d6183f9cdb32":{"type":"pagefly-section","settings":{"section_id":"pf-c52849c9"}}},"order":["main","d49bd09d-3411-49ca-b909-d6183f9cdb32"]}